test/tsung/contents/http_authenticate.soap12.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <HTTP_Authenticate xmlns="http://pmmsoapmessenger.com/">
      <customerID>10003</customerID>
      <userName>user</userName>
      <userPassword>password</userPassword>
    </HTTP_Authenticate>
  </soap12:Body>
</soap12:Envelope>
